node {
  name: "batch_size/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "batch_size"
      }
    }
  }
}
node {
  name: "batch_size/values"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "batch_size"
  op: "ScalarSummary"
  input: "batch_size/tags"
  input: "batch_size/values"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_size_per_gpu/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "batch_size_per_gpu"
      }
    }
  }
}
node {
  name: "batch_size_per_gpu/values"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "batch_size_per_gpu"
  op: "ScalarSummary"
  input: "batch_size_per_gpu/tags"
  input: "batch_size_per_gpu/values"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "/home/niddal/Desktop/PhD_projects/pixel_link-master/datasets/TF/icdar2017_train.tfrecord"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Greater/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Greater"
  op: "Greater"
  input: "icdar2017_data_provider/parallel_read/filenames/Size"
  input: "icdar2017_data_provider/parallel_read/filenames/Greater/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Assert/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Assert/Assert"
  op: "Assert"
  input: "icdar2017_data_provider/parallel_read/filenames/Greater"
  input: "icdar2017_data_provider/parallel_read/filenames/Assert/Assert/data_0"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/Identity"
  op: "Identity"
  input: "icdar2017_data_provider/parallel_read/filenames/Const"
  input: "^icdar2017_data_provider/parallel_read/filenames/Assert/Assert"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/RandomShuffle"
  op: "RandomShuffle"
  input: "icdar2017_data_provider/parallel_read/filenames/Identity"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/filenames_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "icdar2017_data_provider/parallel_read/filenames"
  input: "icdar2017_data_provider/parallel_read/filenames/RandomShuffle"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/filenames_Close"
  op: "QueueCloseV2"
  input: "icdar2017_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/filenames_Close_1"
  op: "QueueCloseV2"
  input: "icdar2017_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/filenames_Size"
  op: "QueueSizeV2"
  input: "icdar2017_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/ToFloat"
  op: "Cast"
  input: "icdar2017_data_provider/parallel_read/filenames/filenames_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/mul"
  op: "Mul"
  input: "icdar2017_data_provider/parallel_read/filenames/ToFloat"
  input: "icdar2017_data_provider/parallel_read/filenames/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "icdar2017_data_provider/parallel_read/filenames/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/filenames/fraction_of_32_full"
  op: "ScalarSummary"
  input: "icdar2017_data_provider/parallel_read/filenames/fraction_of_32_full/tags"
  input: "icdar2017_data_provider/parallel_read/filenames/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue"
  op: "RandomShuffleQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 10000
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 7000
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue_Size"
  op: "QueueSizeV2"
  input: "icdar2017_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/ToFloat"
  op: "Cast"
  input: "icdar2017_data_provider/parallel_read/common_queue_Size"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/mul/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.99999974738e-05
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/mul"
  op: "Mul"
  input: "icdar2017_data_provider/parallel_read/ToFloat"
  input: "icdar2017_data_provider/parallel_read/mul/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/fraction_of_10000_full/tags"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "icdar2017_data_provider/parallel_read/fraction_of_10000_full"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/fraction_of_10000_full"
  op: "ScalarSummary"
  input: "icdar2017_data_provider/parallel_read/fraction_of_10000_full/tags"
  input: "icdar2017_data_provider/parallel_read/mul"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/ReaderReadV2"
  op: "ReaderReadV2"
  input: "icdar2017_data_provider/parallel_read/TFRecordReaderV2"
  input: "icdar2017_data_provider/parallel_read/filenames"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "icdar2017_data_provider/parallel_read/common_queue"
  input: "icdar2017_data_provider/parallel_read/ReaderReadV2"
  input: "icdar2017_data_provider/parallel_read/ReaderReadV2:1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue_Close"
  op: "QueueCloseV2"
  input: "icdar2017_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue_Close_1"
  op: "QueueCloseV2"
  input: "icdar2017_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "icdar2017_data_provider/parallel_read/common_queue_Dequeue"
  op: "QueueDequeueV2"
  input: "icdar2017_data_provider/parallel_read/common_queue"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/key_image/encoded"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/key_image/encoded"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/key_image/filename"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape_1/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape_1"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/key_image/filename"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape_1/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/key_image/format"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "jpeg"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape_2/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Reshape_2"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/key_image/format"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape_2/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample"
  op: "ParseSingleExample"
  input: "icdar2017_data_provider/parallel_read/common_queue_Dequeue:1"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape_1"
  input: "icdar2017_data_provider/ParseSingleExample/Reshape_2"
  input: "icdar2017_data_provider/ParseSingleExample/Const"
  device: "/device:CPU:0"
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dense_keys"
    value {
      list {
        s: "image/encoded"
        s: "image/filename"
        s: "image/format"
        s: "image/shape"
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "num_sparse"
    value {
      i: 13
    }
  }
  attr {
    key: "sparse_keys"
    value {
      list {
        s: "image/object/bbox/label"
        s: "image/object/bbox/x1"
        s: "image/object/bbox/x2"
        s: "image/object/bbox/x3"
        s: "image/object/bbox/x4"
        s: "image/object/bbox/xmax"
        s: "image/object/bbox/xmin"
        s: "image/object/bbox/y1"
        s: "image/object/bbox/y2"
        s: "image/object/bbox/y3"
        s: "image/object/bbox/y4"
        s: "image/object/bbox/ymax"
        s: "image/object/bbox/ymin"
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:39"
  input: "icdar2017_data_provider/Reshape/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_1/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_1"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:40"
  input: "icdar2017_data_provider/Reshape_1/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_2/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_2"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:41"
  input: "icdar2017_data_provider/Reshape_2/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_3/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Reshape_3"
  op: "Reshape"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:42"
  input: "icdar2017_data_provider/Reshape_3/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/SparseToDense/default_value"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/SparseToDense"
  op: "SparseToDense"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:4"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:30"
  input: "icdar2017_data_provider/ParseSingleExample/ParseSingleExample:17"
  input: "icdar2017_data_provider/SparseToDense/default_value"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "icdar2017_data_provider/Equal/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "raw"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Equal"
  op: "Equal"
  input: "icdar2017_data_provider/Reshape_2"
  input: "icdar2017_data_provider/Equal/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Equal_1/y"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "RAW"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/Equal_1"
  op: "Equal"
  input: "icdar2017_data_provider/Reshape_2"
  input: "icdar2017_data_provider/Equal_1/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/LogicalOr"
  op: "LogicalOr"
  input: "icdar2017_data_provider/Equal"
  input: "icdar2017_data_provider/Equal_1"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/preds_c"
  op: "Pack"
  input: "icdar2017_data_provider/LogicalOr"
  device: "/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Cast"
  op: "Cast"
  input: "icdar2017_data_provider/case/preds_c"
  device: "/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/num_true_conds"
  op: "Sum"
  input: "icdar2017_data_provider/case/Cast"
  input: "icdar2017_data_provider/case/Const"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "icdar2017_data_provider/case/n_true_conds"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/LessEqual"
  op: "LessEqual"
  input: "icdar2017_data_provider/case/num_true_conds"
  input: "icdar2017_data_provider/case/n_true_conds"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (icdar2017_data_provider/LogicalOr:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/case/LessEqual"
  input: "icdar2017_data_provider/case/LessEqual"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/switch_t"
  op: "Identity"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/Switch:1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/switch_f"
  op: "Identity"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/Switch"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/pred_id"
  op: "Identity"
  input: "icdar2017_data_provider/case/LessEqual"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/NoOp"
  op: "NoOp"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/switch_t"
  device: "/device:CPU:0"
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/control_dependency"
  op: "Identity"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/switch_t"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/NoOp"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/case/Assert/AssertGuard/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/switch_f"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input error: exclusive=True: more than 1 conditions (icdar2017_data_provider/LogicalOr:0) evaluated as True:"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Assert"
  op: "Assert"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/Switch"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/data_0"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/Switch_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_BOOL
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 1
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/case/LessEqual"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/pred_id"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/case/LessEqual"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Assert/Switch_1"
  op: "Switch"
  input: "icdar2017_data_provider/case/preds_c"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/pred_id"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/case/preds_c"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/switch_f"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Assert"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/case/Assert/AssertGuard/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  op: "Merge"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/control_dependency_1"
  input: "icdar2017_data_provider/case/Assert/AssertGuard/control_dependency"
  device: "/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/LogicalOr"
  input: "icdar2017_data_provider/LogicalOr"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/switch_t"
  op: "Identity"
  input: "icdar2017_data_provider/case/cond/Switch:1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/switch_f"
  op: "Identity"
  input: "icdar2017_data_provider/case/cond/Switch"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/pred_id"
  op: "Identity"
  input: "icdar2017_data_provider/LogicalOr"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/DecodeRaw"
  op: "DecodeRaw"
  input: "icdar2017_data_provider/case/cond/DecodeRaw/Switch:1"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/DecodeRaw/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/Reshape"
  input: "icdar2017_data_provider/case/cond/pred_id"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/Reshape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Substr/pos"
  op: "Const"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  input: "^icdar2017_data_provider/case/cond/switch_f"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Substr/len"
  op: "Const"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  input: "^icdar2017_data_provider/case/cond/switch_f"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Substr"
  op: "Substr"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Substr/Switch"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Substr/pos"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Substr/len"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "unit"
    value {
      s: "BYTE"
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Substr/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/Reshape"
  input: "icdar2017_data_provider/case/cond/pred_id"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@icdar2017_data_provider/Reshape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Equal/y"
  op: "Const"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
  input: "^icdar2017_data_provider/case/cond/switch_f"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "\377\330\377"
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/is_jpeg/Equal"
  op: "Equal"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Substr"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Equal/y"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/cond_jpeg/Switch"
  op: "Switch"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Equal"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Equal"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/cond_jpeg/switch_t"
  op: "Identity"
  input: "icdar2017_data_provider/case/cond/cond_jpeg/Switch:1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/cond_jpeg/switch_f"
  op: "Identity"
  input: "icdar2017_data_provider/case/cond/cond_jpeg/Switch"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/cond_jpeg/pred_id"
  op: "Identity"
  input: "icdar2017_data_provider/case/cond/is_jpeg/Equal"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "icdar2017_data_provider/case/cond/cond_jpeg/DecodeJpeg"
  op: "DecodeJpeg"
  input: "icdar2017_data_provider/case/cond/cond_jpeg/DecodeJpeg/Switch:1"
  input: "^icdar2017_data_provider/case/Assert/AssertGuard/Merge"
